blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Research Overview</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Research Overview</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html#org0f0f97b">About</a></td>
<td class="org-left"><a href="blog.html">Research Overview</a></td>
<td class="org-left"><a href="cv.html">CV</a></td>
<td class="org-left"><a href="PaperReviews.html">Startup Adventures</a></td>
</tr>
</tbody>
</table>

<p>
<b><i>Anomaly Detection and Predictive Healthcare.</i></b>
</p>

<p>
We are working at the intersection of healthcare technology and artificial intelligence. Our project aims to enhance the reliability and security of Wireless Body Area Networks (WBANs) through a comprehensive three-pronged approach. We're developing a system that combines advanced fault management, privacy-preserving federated learning, and intelligent anomaly detection to create more robust and secure health monitoring networks. By leveraging machine learning and deep learning algorithms, our solution will enhance the detection and prevention of network faults, sensor malfunctions, and potential security breaches in real-time.
The project utilizes a federated learning framework that enables WBANs to learn from diverse patient populations while maintaining strict data privacy standards. Our distributed architecture processes sensitive health data locally on devices, sharing only model parameters with a central server, ensuring patient confidentiality. Moreover, we're implementing anomaly detection systems powered by Large Language Models to provide predictive healthcare insights, enabling early intervention and personalized treatment recommendations. This approach introduces a holistic framework for predictive healthcare.
</p>

<p>
<b><i>Comparing Capabilities of Neural Networks and Machine Learning in Rainfall Prediction for North Eastern India</i>, currently submitted for publishing.</b>
</p>

<p>
Forecasting rainfall accurately is crucial for agriculture, water management, and disaster preparedness, yet existing methods often sacrifice interpretability for accuracy. Our research bridges this gap by combining modern machine learning approaches with transparent, explainable models.
We developed two complementary systems for rainfall prediction. The first utilizes Explainable Boosting Machines (EBM) that categorize rainfall into six intensity levels, from trace to extremely heavy. This approach makes our predictions more accessible and trustworthy for both experts and the general public. The second system comprises two neural network models: a simple single-layer network and a more sophisticated deep neural network with dynamic architecture, allowing us to capture complex patterns in rainfall behavior.
Our models draw insights from 30 years (1991-2020) of ERA5 climate data, focused on North-Eastern India and surrounding regions. The analysis incorporates seven key meteorological variables: dew point, skin temperatures, solar radiation, wind components, surface pressure, and total precipitation. This comprehensive dataset ensures our models capture the full complexity of rainfall patterns in the region.
What sets our approach apart is its ability to maintain high prediction accuracy while remaining interpretable to both meteorologists and the public. This transparency is particularly valuable as rainfall forecasting directly impacts agricultural planning, water resource management, and flood prevention strategies. Our research demonstrates that sophisticated forecasting methods can deliver both precision and clarity, making weather predictions more accessible and actionable for communities that depend on them.
</p>

<p>
<b><i>Applications of Generative AI in Software Engineering - Building SLM for a Financial Firm for Contract Generation.</i></b>
</p>

<p>
Our research project addresses a critical gap in the financial technology sector by developing cost-effective custom language models specifically designed for small and medium-sized financial institutions.
The project's core objectives include developing cost-effective custom language models with prediction accuracy exceeding 90%, ensuring adaptability to new data, optimizing resource utilization, and creating a scalable AI framework that can serve diverse financial institutions. To achieve these goals, we've implemented a comprehensive four-phase methodology that combines cutting-edge techniques with practical considerations.
Our approach begins with thorough data preparation, incorporating advanced collection and preprocessing techniques to ensure high-quality training data. This phase includes rigorous data cleaning, feature engineering, and data augmentation processes to enhance the model's learning capabilities. The second phase focuses on model building, where we develop and compare two variants of Small Language Models: character-level and token-level. Through systematic A/B testing, we evaluate each model's performance to determine the most effective approach for our specific use case.
For the refinement phase, we've integrated our models with Llama's 8-billion parameter model, chosen specifically for its robust customization capabilities and strong data security features. This integration allows for local deployment, ensuring sensitive financial data remains secure while still benefiting from advanced language model capabilities. The final phase implements Reinforcement Learning from Human Feedback (RLHF), incorporating expert feedback to fine-tune the model's responses and ensure they align perfectly with real-world financial sector requirements.
Our implementation utilizes key technologies including PyTorch and Tiktoken (GPT-2's tokenizer), incorporating advanced components such as embeddings, positional encoding, and transformer blocks with multi-head attention mechanisms.
The training procedure employs techniques such as the AdamW optimizer with cosine annealing and gradient clipping to prevent exploding gradients, ensuring optimal model performance.
</p>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
